_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_71 (Conv2D)           (None, 100, 100, 32)      896
_________________________________________________________________
conv2d_72 (Conv2D)           (None, 100, 100, 64)      18496
_________________________________________________________________
activation_53 (Activation)   (None, 100, 100, 64)      0
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 33, 33, 64)        0
_________________________________________________________________
spatial_dropout2d_16 (Spatia (None, 33, 33, 64)        0
_________________________________________________________________
conv2d_73 (Conv2D)           (None, 33, 33, 64)        36928
_________________________________________________________________
activation_54 (Activation)   (None, 33, 33, 64)        0
_________________________________________________________________
batch_normalization_35 (Batc (None, 33, 33, 64)        256
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 33, 33, 64)        36928
_________________________________________________________________
activation_55 (Activation)   (None, 33, 33, 64)        0
_________________________________________________________________
batch_normalization_36 (Batc (None, 33, 33, 64)        256
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 16, 16, 64)        0
_________________________________________________________________
dropout_37 (Dropout)         (None, 16, 16, 64)        0
_________________________________________________________________
flatten_18 (Flatten)         (None, 16384)             0
_________________________________________________________________
dense_35 (Dense)             (None, 512)               8389120
_________________________________________________________________
dropout_38 (Dropout)         (None, 512)               0
_________________________________________________________________
dense_36 (Dense)             (None, 31)                15903
=================================================================
Total params: 8,498,783
Trainable params: 8,498,527
Non-trainable params: 256
